---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.Time
source: html/36a12288-33ab-d6dd-2770-04bcaf607361.htm
---
# Autodesk.Revit.DB.SpecTypeId.Time Property

Time, in discipline Common.

## Syntax (C#)
```csharp
public static ForgeTypeId Time { get; }
```